import {
  bed11Img,
  bed12Img,
  bed13Img,
  bed14Img,
  bed15Img,
  bed16Img,
  bed17Img,
  bed18Img,
  bed19Img,
  bed21Img,
  bed22Img,
  bed23Img,
  bed24Img,
  bed25Img,
  bed26Img,
  bed27Img,
  bed28Img,
  bed29Img,
  bed210Img,
  bed211Img,
  bed212Img,
  bedVid,
  poster,
  wheelchair1Img,
  wheelchair2Img,
  wheelchair3Img,
} from 'shared/assets/images';
import { Product } from 'shared/assets/types/product';

export const products: Product[] = [
  {
    id: 1,
    name: 'Многофункциональные кровати с электроприводом',
    price: '3 999 ₽ / мес',
    description:
      'Аренда медицинской кровати с электроприводом и трансформацией в кресло. Подходит для лежачих больных и пациентов с ограниченной подвижностью. Функция переворота, управление пультом, туалетное устройство, боковые ограждения, штанга для подтягивания и инфузионная стойка. Отличное решение для домашнего ухода и профилактики пролежней. Максимальная нагрузка — 200 кг.',
    media: [
      {
        type: 'image',
        src: bed11Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed12Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed13Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed14Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed15Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      { type: 'video', src: bedVid, poster: poster },

      {
        type: 'image',
        src: bed16Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed17Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed18Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed19Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
    ],
  },
  {
    id: 2,
    name: 'Медицинские кровати с функцией переворачивания и кардио-креслом',
    price: '3 999 ₽ / мес',
    description:
      'Функциональная медицинская кровать в аренду для лежачих больных с ручным переворачиванием. Комплектация включает кардио-кресло, туалетное устройство, надкроватный столик и жесткий матрас. Боковые алюминиевые ограждения, самоориентирующиеся колеса с тормозами, штанга для подтягивания.',
    media: [
      {
        type: 'image',
        src: bed21Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed22Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed23Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed24Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed25Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed26Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed27Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed28Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed29Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed210Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed211Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed212Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
    ],
  },
  {
    id: 3,
    name: 'Инвалидное кресло-коляска стандартное',
    price: '1 499 ₽ / мес',
    media: [
      {
        type: 'image',
        src: wheelchair1Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
      {
        type: 'image',
        src: wheelchair2Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
      {
        type: 'image',
        src: wheelchair3Img,
        altLabel: 'Инвалидное кресло-коляска стандартное',
      },
    ],
  },
];
