import {
  bed11Img,
  bed12Img,
  bed13Img,
  bed14Img,
  bed15Img,
  bed16Img,
  bed17Img,
  bed18Img,
  bed19Img,
  bed21Img,
  bed22Img,
  bed23Img,
  bed24Img,
  bed25Img,
  bed26Img,
  bed27Img,
  bed28Img,
  bed29Img,
  bed210Img,
  bed211Img,
  bed212Img,
  bedVid,
} from 'shared/assets/images';
import { Product } from 'shared/assets/types/product';

export const products: Product[] = [
  {
    id: 1,
    name: 'Многофункциональные кровати с электроприводом',
    price: '3 999 ₽ / мес',
    description:
      'Идеальный выбор для ухода за пациентами с ограниченной мобильностью. Кровать оснащена функцией трансформации в кресло, электропереворотом и пультом для регулировки положения тела. Включает туалетное устройство с электроуправлением, складные боковые ограждения, штангу для подтягивания и инфузионную стойку. Удобное решение для комфортного ухода и профилактики пролежней. Максимальная нагрузка — 200 кг',

    media: [
      {
        type: 'image',
        src: bed11Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed12Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed13Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed14Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed15Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed16Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed17Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed18Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      {
        type: 'image',
        src: bed19Img,
        altLabel:
          'Медицинская кровать с электроприводом и туалетным устройством в аренду Симферополь',
      },
      { type: 'video', src: bedVid },
    ],
  },
  {
    id: 2,
    name: 'Медицинские кровати с функцией переворачивания и кардио-креслом',
    price: '3 999 ₽ / мес',
    description:
      'Кровати оснащены туалетным устройством, надкроватным столиком и матрасом с усиленной жесткостью. Функциональные медицинские кровати предназначены для лежачих больных: функция переворачивания осуществляется с помощью вращения рукояток, что помогает предотвратить пролежни и улучшить кровообращение. Удобные винтовые регулировки, алюминиевые боковые ограждения с фиксацией, самоориентирующиеся колеса и тормоза обеспечивают комфорт и безопасность. Также в комплект входит штанга для подтягивания.',
    media: [
      {
        type: 'image',
        src: bed21Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed22Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed23Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed24Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed25Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed26Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed27Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed28Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed29Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed210Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed211Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
      {
        type: 'image',
        src: bed212Img,
        altLabel:
          'Медицинские кровати для лежачих больных с функцией переворачивания',
      },
    ],
  },
];
